TestEDT/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <comment>ДУ</comment>
  <predefined>
    <items>
      <name>НегосударственноеПенсионноеОбеспечение</name>
      <description>Негосударственное пенсионное обеспечение</description>
    </items>
    <items>
      <name>ОбязательноеПенсионноеСтрахование</name>
      <description>Обязательное пенсионное страхование</description>
    </items>
    <items>
      <name>УставнаяДеятельность</name>
      <description>Уставная деятельность</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФонда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestEDT/src/Catalogs/ВидыДеятельности/ManagerModule.bsl
#Область ПРОГРАМНЫЙ_ИНТЕРФЕЙС 

Функция НомерПоВидуДеятельности(ПризнакВидовДеятельности) Экспорт 
		
	НомерПоВидуДеятельности = 0;
	
	Если ПризнакВидовДеятельности = Справочники.ВидыДеятельности.ОбязательноеПенсионноеСтрахование Тогда 
		НомерПоВидуДеятельности = 1;
	ИначеЕсли ПризнакВидовДеятельности =  Справочники.ВидыДеятельности.НегосударственноеПенсионноеОбеспечение Тогда 
		НомерПоВидуДеятельности = 2;
	ИначеЕсли ПризнакВидовДеятельности =  Справочники.ВидыДеятельности.УставнаяДеятельность Тогда 
		НомерПоВидуДеятельности = 3;
	КонецЕсли;
	
	Возврат НомерПоВидуДеятельности;
	
КонецФункции

#КонецОбласти
